Tekla Open API Reference for Tekla Structures 2025
ClipPlane.IsScissorVisible Property
Gets or sets a value indicating whether the clip plane scissor icon is visible.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsScissorVisible { get; set; }
Public Property IsScissorVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
True if the scissor icon is visible otherwise false.
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace